/*
* Copyright (c) 佛山市南华仪器股份有限公司
* All rights reserved.
*
* 文件名称：ManDetItemDef.h
* 文件标识：
* 描述：人工检测项目定义
*
* 版本：1.0
* 日期：20xx-xx-xx
* 作者：dgw
*
*
* 历史信息：
*
* 版本：
* 日期：20xx-xx-xx
* 作者：dgw
* 描述：正在开发
*/

#ifndef MAN_DET_ITEM_DEF
#define MAN_DET_ITEM_DEF

const int g_nVehManDetItemNum(104); // 汽车人工检测项目项数

// 汽车人工检测项目定义
// 第1维：序号
// 第2维，0：项目代码，1：项目名称，1：项目属性
const CStringW g_strVehManDetItemDef[][3] =
{
	{L"1", L"车辆号牌", L"1"}, // 1
	{L"2", L"车辆类型、品牌/型号", L"1"}, // 2
	{L"3", L"车身颜色", L"1"}, // 3
	{L"4", L"VIN（整车出厂编号）", L"1"}, // 4
	{L"5", L"发动机号码", L"1"}, // 5
	{L"6", L"主要特征及技术参数", L"1"}, // 6
	{L"7", L"保险杠", L"2"}, // 7
	{L"8", L"后视镜/下视镜", L"1"}, // 8
	{L"9", L"车窗玻璃", L"1"}, // 9
	{L"10", L"车体周正、尖锐突出物", L"1"}, // 10
	{L"11", L"漆面", L"3"}, // 11
	{L"12", L"货箱/安全架/车外顶行李架", L"1"}, // 12
	{L"13", L"车身广告与文字标志、标识", L"1"}, // 13
	{L"14", L"自行加装装置", L"1"}, // 14
	{L"15", L"整车3C标志", L"2"}, // 15
	{L"16", L"其他注册登记检验增加项目", L"1"}, // 16
	{L"17", L"前位灯/后位灯、侧标志灯", L"1"}, // 17
	{L"18", L"后牌照灯", L"1"}, // 18
	{L"19", L"示廓灯/挂车标志灯", L"1"}, // 19
	{L"20", L"转向信号灯（前、后、侧）、危险警告信号灯", L"1"}, // 20
	{L"21", L"前照灯（远光、近光）", L"1"}, // 21
	{L"22", L"制动灯", L"1"}, // 22
	{L"23", L"后反射器、侧反射器", L"1"}, // 23
	{L"24", L"后雾灯", L"1"}, // 24
	{L"25", L"倒车灯", L"1"}, // 25
	{L"26", L"道路运输危险货物车辆标识", L"1"}, // 26
	{L"27", L"特种车辆标志灯具", L"1"}, // 27
	{L"28", L"附加灯具、反射器或附属装置", L"1"}, // 28
	{L"29", L"喇叭", L"1"}, // 29
	{L"30", L"车身反光标识", L"1"}, // 30
	{L"31", L"发动机各系统机件", L"3"}, // 31
	{L"32", L"蓄电池桩头及联线", L"3"}, // 32
	{L"33", L"电器导线、各种管路", L"1"}, // 33
	{L"34", L"液压制动储液器液面", L"1"}, // 34
	{L"35", L"发动机标识", L"2"}, // 35
	{L"36", L"门锁及门铰链", L"3"}, // 36
	{L"37", L"驾驶员座椅", L"1"}, // 37
	{L"38", L"安全带", L"1"}, // 38
	{L"39", L"风窗玻璃驾驶员视区部位", L"1"}, // 39
	{L"40", L"刮水器", L"1"}, // 40
	{L"41", L"洗涤器", L"3"}, // 41
	{L"42", L"汽车行驶记录仪", L"1"}, // 42
	{L"43", L"驾驶室固定、操纵辅助装置", L"1"}, // 43
	{L"44", L"仪表数量和类型", L"2"}, // 44
	{L"45", L"操纵件、指示器及信号装置的图形标志", L"2"}, // 45
	{L"46", L"警告性文字中的中文标注", L"2"}, // 46
	{L"47", L"车辆产品标牌", L"2"}, // 47
	{L"48", L"起动", L"1"}, // 48
	{L"49", L"怠速、仪表、电源充电", L"3"}, // 49
	{L"50", L"加速踏板控制", L"3"}, // 50
	{L"51", L"漏水、油、气/水温、油压", L"3"}, // 51
	{L"52", L"关电熄火/柴油车停机装置", L"1"}, // 52
	{L"53", L"座椅/卧铺数量，座椅间距", L"1"}, // 53
	{L"54", L"扶手和卧铺护栏", L"3"}, // 54
	{L"55", L"车厢灯、门灯", L"3"}, // 55
	{L"56", L"客车地板、车内行李架", L"3"}, // 56
	{L"57", L"灭火器、安全出口标识、安全手锤、安全门", L"1"}, // 57
	{L"58", L"安全带", L"1"}, // 58
	{L"59", L"安全出口的数量、位置和尺寸", L"2"}, // 59
	{L"60", L"乘客通道，通往安全门的通道", L"2"}, // 60
	{L"61", L"燃料箱、燃料箱盖", L"1"}, // 61
	{L"62", L"挡泥板/牵引钩、蓄电池、蓄电池架", L"3"}, // 62
	{L"63", L"贮气筒排污阀", L"3"}, // 63
	{L"64", L"钢板弹簧", L"1"}, // 64
	{L"65", L"侧面及后下部防护装置", L"1"}, // 65
	{L"66", L"牵引连接装置", L"3"}, // 66
	{L"67", L"轮胎型号/规格/速度级别", L"1"}, // 67
	{L"68", L"胎冠花纹深度、胎面", L"1"}, // 68
	{L"69", L"轮胎螺栓、半轴螺栓", L"1"}, // 69
	{L"70", L"备胎标识", L"2"}, // 70
	{L"71", L"其他不符合规定的情形", L"3"}, // 71
	{L"72", L"方向盘最大自由转动量", L"1"}, // 72
	{L"73", L"转向沉重", L"1"}, // 73
	{L"74", L"自动回正、直线行驶能力", L"3"}, // 74
	{L"75", L"离合器", L"3"}, // 75
	{L"76", L"变速器", L"3"}, // 76
	{L"77", L"传动轴/链", L"3"}, // 77
	{L"78", L"驱动桥", L"3"}, // 78
	{L"79", L"点制动跑偏（20km/h）", L"3"}, // 79
	{L"80", L"低气压报警装置", L"1"}, // 80
	{L"81", L"弹簧蓄能制动器", L"3"}, // 81
	{L"82", L"防抱制动装置", L"1"}, // 82
	{L"83", L"仪表和指示器", L"1"}, // 83
	{L"84", L"转向器固定", L"1"}, // 84
	{L"85", L"转向各部件", L"1"}, // 85
	{L"86", L"变速器支架", L"1"}, // 86
	{L"87", L"分动器支架", L"1"}, // 87
	{L"88", L"传动各部件", L"1"}, // 88
	{L"89", L"钢板吊耳", L"1"}, // 89
	{L"90", L"吊耳销", L"1"}, // 90
	{L"91", L"中心螺栓", L"3"}, // 91
	{L"92", L"U型螺栓", L"3"}, // 92
	{L"93", L"车桥移位", L"1"}, // 93
	{L"94", L"车架纵梁", L"3"}, // 94
	{L"95", L"车架横梁", L"3"}, // 95
	{L"96", L"悬架杆系", L"3"}, // 96
	{L"97", L"制动系部件、结构改动", L"1"}, // 97
	{L"98", L"制动主缸、轮缸、制动管路漏气、漏油", L"1"}, // 98
	{L"99", L"制动软管老化", L"1"}, // 99
	{L"100", L"制动管路固定", L"1"}, // 100
	{L"101", L"电器线路检查", L"1"}, // 101
	{L"102", L"发动机固定", L"1"}, // 102
	{L"103", L"排气管、消声器", L"1"}, // 103
	{L"104", L"燃料管路", L"1"}, // 104
};

const int g_nVehManDetItemNum_2014(50); // 汽车人工检测项目项数

// 汽车人工检测项目定义
// 第1维：序号
// 第2维，0：项目代码，1：项目名称，1：项目属性
const CStringW g_nVehManDetItemNum_STD[][3] =
{
	{L"1", L"号牌号码/车辆类型", L"1"}, // 1
	{L"2", L"车辆品牌/型号", L"1"}, // 2
	{L"3", L"车辆识别代号", L"1"}, // 3
	{L"4", L"发动机号码", L"1"}, // 4
	{L"5", L"车辆颜色和外形", L"1"}, // 5
	{L"6", L"外廓尺寸", L"1"}, // 6
	{L"7", L"轴距", L"2"}, // 7
	{L"8", L"整备质量", L"1"}, // 8
	{L"9", L"核定载人数", L"1"}, // 9
	{L"10", L"核定载质量", L"1"}, // 10
	{L"11", L"栏板高度", L"3"}, // 11
	{L"12", L"后轴钢板弹簧片数", L"1"}, // 12
	{L"13", L"客车应急出口", L"1"}, // 13
	{L"14", L"客车乘客通道和引道", L"1"}, // 14
	{L"15", L"货厢", L"2"}, // 15
	{L"16", L"车身外观", L"1"}, // 16
	{L"17", L"外观标识、标注和标牌", L"1"}, // 17
	{L"18", L"外部照明和信号灯具", L"1"}, // 18
	{L"19", L"轮胎", L"1"}, // 19
	{L"20", L"号牌及号牌安装", L"1"}, // 20
	{L"21", L"加装/改装灯具", L"1"}, // 21
	{L"22", L"汽车安全带", L"1"}, // 22
	{L"23", L"机动车用三角警告牌", L"1"}, // 23
	{L"24", L"灭火器", L"1"}, // 24
	{L"25", L"行驶记录装置", L"1"}, // 25
	{L"26", L"车身反光标识", L"1"}, // 26
	{L"27", L"车辆尾部标志板", L"1"}, // 27
	{L"28", L"侧后防护装置", L"1"}, // 28
	{L"29", L"应急锤", L"1"}, // 29
	{L"30", L"急救箱", L"1"}, // 30
	{L"31", L"限速功能或限速装置", L"3"}, // 31
	{L"32", L"防抱死制动装置", L"3"}, // 32
	{L"33", L"辅助制动装置", L"1"}, // 33
	{L"34", L"盘式制动器", L"1"}, // 34
	{L"35", L"紧急切断装置", L"2"}, // 35
	{L"36", L"发动机舱自动灭火装置", L"3"}, // 36
	{L"37", L"手动机械断电开关", L"1"}, // 37
	{L"38", L"副制动踏板", L"1"}, // 38
	{L"39", L"校车标志灯和校车停车指示标志牌", L"1"}, // 39
	{L"40", L"危险货物运输车标志", L"1"}, // 40
	{L"41", L"肢体残疾人操纵辅助装置", L"1"}, // 40
	{L"42", L"转向系", L"3"}, // 41
	{L"43", L"传动系", L"1"}, // 42
	{L"44", L"制动系", L"1"}, // 43
	{L"45", L"仪表和指示器", L"2"}, // 44
	{L"46", L"转向系部件", L"2"}, // 45
	{L"47", L"传动系部件", L"2"}, // 46
	{L"48", L"行驶系部件", L"2"}, // 47
	{L"49", L"制动系部件", L"1"}, // 48
	{L"50", L"其它部件", L"3"}, // 49
};

const int g_nMotoManDetItemNum(50); // 摩托车人工检测项目项数

// 摩托车人工检测项目定义
// 第1维：序号
// 第2维，0：项目代码，1：项目名称，1：项目属性
const CStringW g_strMotoManDetItemDef[][3] =
{
	{L"1", L"号牌及安装", L"1"}, // 1
	{L"2", L"车辆类型、品牌/型号", L"1"}, // 2
	{L"3", L"车身颜色", L"1"}, // 3
	{L"4", L"VIN（整车出厂编号）", L"1"}, // 4
	{L"5", L"发动机号", L"1"}, // 5
	{L"6", L"主要特征及技术参数", L"1"}, // 6
	{L"7", L"后视镜", L"1"}, // 7
	{L"8", L"风窗玻璃", L"1"}, // 8
	{L"9", L"刮水器", L"1"}, // 9
	{L"10", L"货厢、安全架", L"3"}, // 10
	{L"11", L"漆面", L"3"}, // 11
	{L"12", L"仪表", L"1"}, // 12
	{L"13", L"前照灯（远、近光）", L"1"}, // 13
	{L"14", L"转向信号灯（前、后）", L"1"}, // 14
	{L"15", L"后位灯、后牌照灯", L"1"}, // 15
	{L"16", L"制动灯", L"1"}, // 16
	{L"17", L"后发射器", L"1"}, // 17
	{L"18", L"侧发射器", L"3"}, // 18
	{L"19", L"喇叭", L"1"}, // 19
	{L"20", L"轮胎型号规格", L"1"}, // 20
	{L"21", L"轮胎花纹深度", L"1"}, // 21
	{L"22", L"胎面破裂/割伤/磨损/变形", L"1"}, // 22
	{L"23", L"轮胎螺栓", L"1"}, // 23
	{L"24", L"前后减震器", L"3"}, // 24
	{L"25", L"转向上、下联板", L"1"}, // 25
	{L"26", L"方向把", L"1"}, // 26
	{L"27", L"座垫、扶手（或拉带）、脚蹬", L"3"}, // 27
	{L"28", L"挡泥板", L"3"}, // 28
	{L"29", L"仪表数量和类型", L"2"}, // 29
	{L"30", L"车辆产品标牌", L"2"}, // 30
	{L"31", L"整车3C标志", L"2"}, // 31
	{L"32", L"其他不符合规定情形", L"1"}, // 32
	{L"33", L"起动性能", L"1"}, // 33
	{L"34", L"怠速", L"3"}, // 34
	{L"35", L"电源充电", L"3"}, // 35
	{L"36", L"仪表及指示器", L"3"}, // 36
	{L"37", L"加速把手/踏板控制", L"3"}, // 37
	{L"38", L"柴油机停机装置", L"1"}, // 38
	{L"39", L"转向轮左右转角", L"1"}, // 39
	{L"40", L"方向盘最大自由转动量", L"1"}, // 40
	{L"41", L"离合器接合情况", L"3"}, // 41
	{L"42", L"变速器换档", L"3"}, // 42
	{L"43", L"传动轴/链及传动各部件", L"3"}, // 43
	{L"44", L"油门控制", L"3"}, // 44
	{L"45", L"制动性能", L"3"}, // 45
	{L"46", L"车架", L"3"}, // 46
	{L"47", L"电器线路固定", L"1"}, // 47
	{L"48", L"排气管", L"1"}, // 48
	{L"49", L"消声器", L"1"}, // 49
	{L"50", L"燃料箱、燃料管路", L"1"}, // 50
};

#endif