/*
* Copyright (c) 佛山市南华仪器股份有限公司
* All rights reserved.
*
* 文件名称：ManDetItemDes.h
* 文件标识：
* 描述：人工检测项目描述（根据湘潭综地方要求设计）
*
* 版本：1.0
* 日期：20xx-xx-xx
* 作者：Cyx
*
*
* 历史信息：
*
* 版本：
* 日期：20xx-xx-xx
* 作者：Cyx
* 描述：正在开发
*/

#ifndef MAN_DET_ITEM_DES
#define MAN_DET_ITEM_DES

// 第1维：序号
// 第2维： 0：二级维护，1:二级维护项目标识(0：关键项 1：一般项 2：评级项)
//         2：等级评定，3:等级评定项目标识(0：关键项 1：一般项 2：评级项)
const CStringW g_strManDetItemDes[][4] =
{
	{L"防雨密封性", L"0", L"制动防抱死装置", L"0"}, // 0
	{L"号牌号码", L"0", L"制动防抱死装置", L"0"}, // 1
	{L"车辆类型", L"0", L"盘式制动器", L"0"}, // 2
	{L"品牌型号", L"0", L"缓速器或其他辅助制动装置", L"0"}, // 3
	{L"车身颜色", L"0", L"制动间隙自动调整装置", L"0"}, // 4
	{L"发动机号", L"0", L"压缩空气干燥或油水分离装置", L"0"}, // 5
	{L"底盘号", L"0", L"子午线轮胎", L"0"}, // 6
	{L"VIN号", L"0", L"安全带", L"0"}, // 7
	{L"挂车架号", L"0", L"限速功能、限速装置", L"0"}, // 8
	{ L"外廓尺寸", L"0", L"卫星定位系统车载终端", L"0"}, // 9
	{L"车厢栏板高度", L"0", L"发动机舱内自动灭火装置", L"0"}, // 10
	{L"客车座(铺)位数", L"0", L"号牌号码", L"0"}, // 11
	{L"发动机排放控制系统", L"0", L"车辆类型", L"0"}, // 12
	{L"制动防抱死装置(ABS)", L"0", L"品牌型号", L"0"}, // 13
	{L"电动助力转向系统(EPS)", L"0", L"车身颜色", L"0"}, // 14
	{L"其他与行车安全相关的故障信息", L"0", L"发动机号", L"0"}, // 15
	{L"助力转向传动带", L"0", L"底盘号", L"0"}, // 16
	{L"空气压缩机传动带/齿轮箱", L"0", L"VIN号", L"0"}, // 17
	{L"燃料供给管路与部件", L"0", L"挂车架号", L"0"}, // 18
	{L"车轮及螺栓、螺母", L"0", L"客车座(铺)位数", L"0"}, // 19
	{L"轮胎胎面状况", L"0", L"发动机排放控制系统", L"0"}, // 20
	{L"轮胎花纹深度", L"0", L"制动防抱死装置(ABS)", L"0"}, // 21
	{L"同轴轮胎规格和花纹", L"0", L"电动助力转向系统(EPS)", L"0"}, // 22
	{L"轮胎速度级别", L"0", L"其他与行车安全相关的故障信息", L"0"}, // 23
	{L"轮胎气压", L"0", L"助力转向传动带", L"0"}, // 24
	{L"翻新轮胎的使用", L"0", L"空气压缩机传动带/齿轮箱", L"0"}, // 25
	{ L"子午线轮胎", L"0", L"燃料供给管路与部件", L"0"}, // 26
	{ L"备用轮胎", L"0", L"车轮及螺栓、螺母", L"0"}, // 27
	{ L"前照灯与远、近光光束变换", L"0", L"轮胎胎面状况", L"0"}, // 28
	{ L"转向灯", L"0", L"同轴轮胎规格和花纹", L"0"}, // 29
	{L"示廓灯", L"0", L"轮胎速度级别", L"0"}, // 30
	{L"危险报警闪光灯", L"0", L"轮胎气压", L"0"}, // 31
	{L"雾灯", L"0", L"翻新轮胎的使用", L"0"}, // 32
	{L"反射器与测标志灯", L"0", L"子午线轮胎", L"0"}, // 33
	{L"货车车身反光标识和尾部标志版", L"0", L"备用轮胎", L"0"}, // 34
	{L"导线绝缘层、线束固定", L"0", L"前照灯与远、近光光束变换", L"0"}, // 35
	{L"电缆线及连接蓄电池接头、绝缘套", L"0", L"转向灯", L"0"}, // 36
	{L"穿过金属孔时的绝缘护套", L"0", L"示廓灯", L"0"}, // 37
	{L"车门应急控制器", L"0", L"危险报警闪光灯", L"0"}, // 38
	{L"应急门", L"0", L"雾灯", L"0"}, // 39
	{L"安全顶窗", L"0", L"反射器与测标志灯", L"0"}, // 40
	{L"应急窗开启", L"0", L"货车车身反光标识和尾部标志版", L"0"}, // 41
	{L"玻璃破碎装置", L"0", L"绝缘层", L"0"}, // 42
	{L"门、窗玻璃", L"1", L"蓄电池连接", L"0"}, // 43
	{L"客车车厢灯和门灯", L"1", L"绝缘护套", L"0"}, // 44
	{L"车身与驾驶室", L"1", L"车门应急控制器", L"0"}, // 45
	{L"对称部位高度差", L"0", L"应急门", L"0"}, // 46
	{L"外部和内部尖锐凸起物", L"0", L"安全顶窗", L"0"}, // 47
	{L"车身表面涂装", L"1", L"应急窗开启", L"0"}, // 48
	{L"货车货箱、车门、栏板、底板和栏板锁止机构", L"0", L"玻璃破碎装置", L"0"}, // 49
	{L"驾驶室车窗玻璃附加物及镜面反光遮阳膜", L"0", L"客车车厢灯和门灯", L"1"}, // 50
	{L"后视镜和下视镜", L"0", L"外部和内部尖锐凸起物", L"0"}, // 51
	{L"防眩目装置", L"0", L"货车货箱、车门、栏板、底板和栏板锁止机构", L"0"}, // 52
	{L"安全带", L"0", L"驾驶室车窗玻璃附加物及镜面反光遮阳膜", L"0"}, // 53
	{L"侧面防护装置", L"1", L"后视镜和下视镜", L"0"}, // 54
	{L"后部防护装置", L"0", L"防眩目装置", L"0"}, // 55
	{L"保险杠", L"0", L"安全带", L"0"}, // 56
	{L"汽车列车牵引装置和安全锁止机构", L"0", L"侧面防护装置", L"0"}, // 57
	{L"固定集装箱箱体的锁止机构", L"0", L"后部防护装置", L"0"}, // 58
	{L"安全架与隔离装置", L"0", L"保险杠", L"1"}, // 59
	{L"灭火器材", L"0", L"汽车列车牵引装置和安全锁止机构", L"0"}, // 60
	{L"警示牌", L"0", L"固定集装箱箱体的锁止机构", L"0"}, // 61
	{L"停车楔", L"0", L"安全架与隔离装置", L"0"}, // 62
	{L"危货排气管、隔热和熄灭火星装置", L"0", L"灭火器材", L"0"}, // 63
	{L"危货切断总电源和隔离电火花装置", L"0", L"警示牌", L"0"}, // 64
	{L"危货导静电拖地带", L"0", L"停车楔", L"0"}, // 65
	{L"危货运输车辆标识及标识", L"0", L"危货排气管、隔热和熄灭火星装置", L"0"}, // 66
	{L"危货罐体检验合格证明或报告", L"0", L"危货切断总电源和隔离电火花装置", L"0"}, // 67
	{L"气瓶、可移动罐(槽)紧固装置", L"0", L"危货导静电拖地带", L"0"}, // 68
	{L"起动性能", L"1", L"危货运输车辆标识及标识", L"0"}, // 69
	{L"柴油发动机停机装置", L"0", L"危货罐体检验合格证明或报告", L"0"}, // 70
	{L"发动机低、中、高速运转", L"1", L"气瓶、可移动罐(槽)紧固装置", L"0"}, // 71
	{L"制动报警装置", L"0", L"起动性能", L"1"}, // 72
	{L"气压制动弹簧储能装置", L"1", L"柴油发动机停机装置", L"0"}, // 73
	{L"制动踏板", L"0", L"发动机低、中、高速运转", L"1"}, // 74
	{L"驻车制动装置", L"0", L"制动报警装置", L"0"}, // 75
	{L"转向盘最大自由转动量", L"0", L"气压制动弹簧储能装置", L"1"}, // 76
	{L"离合器", L"1", L"制动踏板", L"0"}, // 77
	{L"变速器", L"1", L"驻车制动装置", L"0"}, // 78
	{L"传动件异响", L"1", L"离合器", L"1"}, // 79
	{L"指示器与仪表", L"0", L"变速器", L"1"}, // 80
	{L"卫星定位系统车载终端", L"0", L"传动件异响", L"1"}, // 81
	{L"风窗刮水器", L"0", L"指示器与仪表", L"0"}, // 82
	{L"风窗洗涤器", L"1", L"卫星定位系统车载终端", L"0"}, // 83
	{L"除雾、除霜装置", L"0", L"风窗刮水器", L"0"}, // 84
	{L"发动机密封性", L"1", L"风窗洗涤器", L"1"}, // 85
	{L"制动管路", L"0", L"除雾、除霜装置", L"0"}, // 86
	{L"制动泵(缸)及气(油)路", L"0", L"发动机密封性", L"1"}, // 87
	{L"缓速器", L"0", L"制动管路", L"0"}, // 88
	{L"储气筒", L"0", L"制动泵(缸)及气(油)路", L"0"}, // 89
	{L"转向机构部件连接", L"0", L"缓速器", L"0"}, // 90
	{L"转向机构部件技术状况", L"0", L"储气筒", L"0"}, // 91
	{L"转向助力装置", L"0", L"转向机构部件连接", L"0"}, // 92
	{L"车架", L"0", L"转向机构部件技术状况", L"0"}, // 93
	{L"车桥的可视裂纹及形变", L"0", L"转向助力装置", L"0"}, // 94
	{L"车桥密封性", L"1", L"车架", L"0"}, // 95
	{L"拉杆和导杆", L"0", L"车桥的可视裂纹及形变", L"0"}, // 96
	{L"悬架弹性元件", L"0", L"车桥密封性", L"1"}, // 97
	{L"悬架部件连接", L"0", L"拉杆和导杆", L"0"}, // 98
	{L"减振器", L"1", L"悬架弹性元件", L"0"}, // 99
	{L"万向节与轴承", L"0", L"悬架部件连接", L"0"}, // 100
	{L"排气管和消声器", L"1", L"减振器", L"1"}, // 101
	{L"", L"", L"万向节与轴承", L""}, // 102
	{L"", L"", L"排气管和消声器", L"1"}, // 103
	{L"", L"", L"轮胎花纹深度", L"2"}, // 104
	{L"", L"", L"门、窗玻璃", L"2"}, // 105
	{L"", L"", L"车身与驾驶室", L"2"}, // 106
	{L"", L"", L"对称部位高度差", L"2"}, // 107
	{L"", L"", L"车身表面涂装", L"2"}, // 108
	{L"", L"", L"转向盘最大自由转动量", L"2"}, // 109
	{L"", L"", L"外廓尺寸", L"0"}, // 110
	{L"", L"", L"车厢栏板高度", L"0"}, // 111

};

#endif
